app/views/menus/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."menu_id" = ?  [["menu_id", 3]]
---
			<h3>Items:</h3>
			<% @menu.items.each do |item| %>