app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
  	@menus = Menu.all

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @menu = Menu.find(params[:id])

INSERT INTO "menus" ("name", "menu_file_file_name", "menu_file_content_type", "menu_file_file_size", "menu_file_updated_at", "created_at", "updated_at", "target_price", "file_contents") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@menu = Menu.new(menu_params)

  	if @menu.save